run/ensembleWorkflow/templatedir/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

volFieldValue1
{
    type            volFieldValue;
    libs            ("libfieldFunctionObjects.so");
    log             true;
    writeControl    writeTime;
    writeFields     true;

    cellZone        all;
    operation       maxMag;


    fields
    (
        p
        U
    );

}

// ************************************************************************* //
